app/controllers/articles_controller.rb

  def index
    # cited=0|1
    # query=(doi fragment)
    # order=doi|published_on (whitelist, default to published_on desc)
    # source=source_type

    collection = Article
    collection = collection.cited(params[:cited]) if params[:cited]
    collection = collection.query(params[:query]) if params[:query]
    collection = collection.order_articles(params[:order])

    @articles = collection.includes(:retrieval_statuses).paginate(:page => params[:page])
---
SELECT DISTINCT `articles`.id FROM `articles` LEFT OUTER JOIN `retrievals` ON retrievals.article_id = articles.id WHERE (EXISTS (SELECT * from retrievals where article_id = `articles`.id GROUP BY article_id HAVING SUM(IFNULL(retrievals.citations_count,0)) + SUM(IFNULL(retrievals.other_citations_count,0)) = 0)) ORDER BY articles.doi LIMIT 0, 30
SELECT count(*) AS count_all FROM `articles` WHERE (EXISTS (SELECT * from retrievals where article_id = `articles`.id GROUP BY article_id HAVING SUM(IFNULL(retrievals.citations_count,0)) + SUM(IFNULL(retrievals.other_citations_count,0)) = 0))

  def load_article_eager_includes
    id_hash = Article.from_uri(params[:id])
    if params[:source]
      @article = Article.where("#{id_hash.keys.first} = ? and lower(sources.name) in (?)", id_hash.values.first, params[:source].downcase.split(",")).
        includes(:retrieval_statuses => :source).first
    else
      @article = Article.where(id_hash).includes(:retrieval_statuses => :source).first
    end

    # raise error if article wasn't found
    raise ActiveRecord::RecordNotFound, "No record for \"#{params[:id]}\" found" if @article.blank?
---
SELECT * FROM `sources` WHERE (`sources`.`id` IN (365262434,12978895))
SELECT * FROM `sources` WHERE (`sources`.`active` = 1)