app/controllers/articles_controller.rb

SELECT `retrievals`.* FROM `retrievals` WHERE (`retrievals`.article_id IN (959844139,562580130,819830547))
---
  def index
    # cited=0|1
    # query=(doi fragment)
    # order=doi|published_on (whitelist, default to doi)
    # source=source_type
    collection = Article
    collection = collection.cited(params[:cited])  if params[:cited]
    collection = collection.query(params[:query])  if params[:query]
    collection = collection.order(params[:order])  if params[:order]

    @articles = collection.paginate :page => params[:page], :per_page => params[:per_page], :include => :retrievals

INSERT INTO `articles` (`created_at`, `retrieved_at`, `pub_med`, `pub_med_central`, `title`, `updated_at`, `doi`, `published_on`, `citations_count`) VALUES('2011-01-13 21:19:33', '1970-01-01 00:00:00', NULL, NULL, NULL, '2011-01-13 21:19:33', '10.0/dummy', NULL, 0)
SELECT * FROM `sources`
INSERT INTO `retrievals` (`created_at`, `retrieved_at`, `other_citations_count`, `running`, `updated_at`, `article_id`, `local_id`, `source_id`, `citations_count`) VALUES('2011-01-13 21:19:33', '1970-01-01 00:00:00', 0, NULL, '2011-01-13 21:19:33', 959844148, NULL, 12978895, 0)
SELECT * FROM `retrievals` WHERE (`retrievals`.`source_id` = 12978895 AND `retrievals`.`article_id` = 959844148) LIMIT 1
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
        flash[:notice] = 'Article was successfully created.'

        Source.all.each do |source|
          Retrieval.find_or_create_by_article_id_and_source_id(@article.id, source.id)

DELETE FROM `articles` WHERE `id` = 959844139
---
  def destroy
    @article.destroy

SELECT * FROM `articles` WHERE (EXISTS (SELECT * from retrievals where article_id = `articles`.id GROUP BY article_id HAVING SUM(IFNULL(retrievals.citations_count,0)) + SUM(IFNULL(retrievals.other_citations_count,0)) = 0)) ORDER BY articles.doi
---
  def load_article(options={})
    # Load one article given query params, for the non-#index actions
    doi = DOI::from_uri(params[:id])
    @article = Article.find_by_doi!(doi, options)