app/controllers/groups_controller.rb

    @result  = []

    # Specifiy the eager loading so we get all the data we need up front
    articles = Article.find(:all,
      :include => [ :retrievals => [ :citations, { :source => :group } ]],
      :conditions => [ "articles.doi in (?) and (retrievals.citations_count > 0 or retrievals.other_citations_count > 0)", ids ])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 959844139) ORDER BY articles.doi
SELECT * FROM `groups` WHERE (`groups`.`id` = 287030888)