app/controllers/sources_controller.rb

  def show
    @source = Source.find_by_name(params[:id])

    # raise error if source wasn't found
    fail ActiveRecord::RecordNotFound, "No record for \"#{params[:id]}\" found" if @source.blank?

    @doc = Doc.find(@source.name)
---
SELECT * FROM `sources` WHERE (`sources`.`id` = 365262434)