app/controllers/sources_controller.rb

SELECT * FROM `sources`
---
  def index
    @doc = Doc.find("sources")

    @groups = Group.includes(:sources).order("groups.id, sources.display_name")

SELECT * FROM `sources` WHERE (`sources`.`id` = 365262434) AND ( (`sources`.`type` = 'CrossRef' ) )
---
  def update
    params[:source] ||= {}
    params[:source][:state_event] = params[:state_event] if params[:state_event]
    @source.update_attributes(safe_params)
    if @source.invalid?
      error_messages = @source.errors.full_messages.join(', ')
      flash.now[:alert] = "Please configure source #{@source.display_name}: #{error_messages}"
      @flash = flash
    end

    if params[:state_event]
      @groups = Group.includes(:sources).order("groups.id, sources.display_name")

SELECT * FROM `sources` WHERE (`sources`.`type` = 'UnconfiguredSource') LIMIT 1
---
  def load_source
    @source = Source.where(name: params[:name]).first

    # raise error if source wasn't found
    fail ActiveRecord::RecordNotFound, "No record for \"#{params[:name]}\" found" if @source.blank?